simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CapSense_v2_0/API/CapSense_SensingCSD_LL.c
/***************************************
* Variables
***************************************/
uint32 `$INSTANCE_NAME`_configCsd = `$INSTANCE_NAME`_DEFAULT_CSD_CONFIG;
/* Flag to indicate electrodes that were connected previously */
static uint8 `$INSTANCE_NAME`_eleCsdDisconnectFlag = 0u;
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN)
    /* Number of re-samplings when the bad conversion occurs */
    uint8 `$INSTANCE_NAME`_badConversionsNum = `$INSTANCE_NAME`_BAD_CONVERSIONS_NUM;
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_NOISE_METRIC_EN) */

#if (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)
    /* Stores IDAC and raw count that corresponds to a sensor with maximum Cp within a widget */
    uint8 `$INSTANCE_NAME`_calibratedIdac = 1u;
    uint16 `$INSTANCE_NAME`_calibratedRawcount = 1u;
    #if (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN || `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN)
        uint8 `$INSTANCE_NAME`_calibratedIdacRow = 1u;
        uint16 `$INSTANCE_NAME`_calibratedRawcountRow = 1u;
    #endif /*(`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN || `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN) */
#endif /* (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) */


/*******************************************************************************
* Static Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
    static void `$INSTANCE_NAME`_SsSetShieldDelay(uint32 delay);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)
        static void `$INSTANCE_NAME`_SsCSDEnableShieldTank(void);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) */

    #if (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT)
        static void `$INSTANCE_NAME`_SsCSDEnableShieldElectrodes(void);
    #endif /* (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT) */

#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

#if ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))

    static cy_status `$INSTANCE_NAME`_SsCSDCalibrateCheck(`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *ptrWdgt, uint32 rawLevel, uint32 rawData);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
        static void `$INSTANCE_NAME`_SsCSDSetSingleIdacMode(void);
        static void `$INSTANCE_NAME`_SsCSDRestoreIdacMode(void);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) */
    static cy_status `$INSTANCE_NAME`_SsCSDCalibrateOneSensor(uint32 rawLevel,
                                                             uint8 *ptrIdac,
                                                             uint8 *iDAC8Max);
#endif /* ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN)) */

static void `$INSTANCE_NAME`_SsCSDSetFilterDelay(void);
static void `$INSTANCE_NAME`_SsCSDCmodPrecharge(void);
static void `$INSTANCE_NAME`_SsCSDTriggerScan(void);
static void `$INSTANCE_NAME`_SsCSDConfigIDACs(void);

static void `$INSTANCE_NAME`_SsCSDSetModeSnsClockDivider(uint32 snsClkSource, uint32 snsClkDivider);

/** \}
* \endcond */


#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
    /*******************************************************************************
    * Function Name: `$INSTANCE_NAME`_SsSetShieldDelay
    ****************************************************************************//**
    *
    * \brief
    *   This is an internal function that sets a shield delay.
    *
    * \details
    *   The function updates the CSD configuration register bits that define the shield
    *   signal delay relatively to the sense signal.
    *
    * \param delay
    *   Specifies the shield delay value:
    *                               0 - no delay
    *                               1 - 5ns delay
    *                               2 - 10ns delay
    *                               3 - 20ns delay
    *
    *******************************************************************************/
    static void `$INSTANCE_NAME`_SsSetShieldDelay(uint32 delay)
    {
        /* Update CSD config register shield delay bits with shield delay value */
        `$INSTANCE_NAME`_configCsd &= (uint32)(~`$INSTANCE_NAME`_CSD_CONFIG_SHIELD_DELAY_MSK);
        `$INSTANCE_NAME`_configCsd |= (delay << `$INSTANCE_NAME`_CSD_CONFIG_SHIELD_DELAY_POS);
    }

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)
        /*******************************************************************************
        * Function Name: `$INSTANCE_NAME`_SsCSDEnableShieldTank
        ****************************************************************************//**
        *
        * \brief
        *   This function configures Csh pin
        *
        * \details
        *   The function updates the CSH_HSIOM register to connect Csh to AMUXBUS-B.
        *   For CSD v1 IP HW block it additionally sets Strong drive mode for Csh
        *   and applies High level to Csh pin when precharge is set to IO buffer.
        *
        *******************************************************************************/
        static void `$INSTANCE_NAME`_SsCSDEnableShieldTank(void)
        {
            Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)`$INSTANCE_NAME`_CSD_CTANK_PORT_PTR, `$INSTANCE_NAME`_CSD_CTANK_PIN, CY_GPIO_DM_ANALOG);
            Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)`$INSTANCE_NAME`_CSD_CTANK_PORT_PTR, `$INSTANCE_NAME`_CSD_CTANK_PIN,
                                                                       (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_AMUXB);
        }
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) */

    #if (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT)
        /*******************************************************************************
        * Function Name: `$INSTANCE_NAME`_SsCSDEnableShieldElectrodes
        ****************************************************************************//**
        *
        * \brief
        *   This internal function initializes Shield Electrodes.
        *
        * \details
        *   The function sets the bit in the HSIOM register which enables the shield electrode
        *   functionality on the pin. The port and pin configurations are stored in
        *   the `$INSTANCE_NAME`_shieldIoList structure.
        *
        *******************************************************************************/
        static void `$INSTANCE_NAME`_SsCSDEnableShieldElectrodes(void)
        {
            uint32 shieldIndex;
            `$INSTANCE_NAME`_FLASH_IO_STRUCT shieldIO;

            for (shieldIndex = 0u; shieldIndex < `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT; shieldIndex++)
            {
                shieldIO = `$INSTANCE_NAME`_shieldIoList[shieldIndex];
                Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)shieldIO.pcPtr, (uint32)shieldIO.pinNumber, `$INSTANCE_NAME`_CSD_SHIELD_GPIO_DM);
                Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)shieldIO.pcPtr, (uint32)shieldIO.pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_CSD_SHIELD_HSIOM_SEL);
            }
        }


