simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CapSense_v2_0/API/CapSense_SensingCSD_LL.c
        /*******************************************************************************
        * Function Name: `$INSTANCE_NAME`_SsCSDDisableShieldElectrodes
        ****************************************************************************//**
        *
        * \brief
        *   This internal function disables Shield Electrodes.
        *
        * \details
        *   The function resets the bit in the HSIOM register which disables the shield
        *   electrode functionality on the pin. The port and pin configurations are
        *   stored in  the `$INSTANCE_NAME`_shieldIoList structure.
        *
        *******************************************************************************/
        void `$INSTANCE_NAME`_SsCSDDisableShieldElectrodes(void)
        {
            uint32 shieldIndex;
            `$INSTANCE_NAME`_FLASH_IO_STRUCT shieldIO;

            for (shieldIndex = 0u; shieldIndex < `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT; shieldIndex++)
            {
                shieldIO = `$INSTANCE_NAME`_shieldIoList[shieldIndex];

                Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)shieldIO.pcPtr, (uint32)shieldIO.pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_GPIO);
                Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)shieldIO.pcPtr, (uint32)shieldIO.pinNumber, CY_GPIO_DM_STRONG);
                Cy_GPIO_Clr((GPIO_PRT_Type*)shieldIO.pcPtr, (uint32)shieldIO.pinNumber);
            }
        }
    #endif /* (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT) */
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDSetModeSnsClockDivider
****************************************************************************//**
*
* \brief
*  Sets sense source and Sense Clock Divider
*
* \details
*  Updates `$INSTANCE_NAME`_SENSE_PERIOD register with
*  sense source and Sense Clock Divider.
*
* \param snsClkSource
*  The sense source for the sense clock.
*
* \param snsClkDivider
*  The divider value for the sense clock.
*
*******************************************************************************/
static void `$INSTANCE_NAME`_SsCSDSetModeSnsClockDivider(uint32 snsClkSource, uint32 snsClkDivider)
{
    /* Update reg value with divider and configuration */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SENSE_PERIOD_PTR, snsClkSource | (snsClkDivider - 1u));
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDSetFilterDelay
****************************************************************************//**
*
* \brief
*   Sets the filter delay for HW IP block.
*
* \details
*   This function updates HW configuration variable `$INSTANCE_NAME`_configCsd
*   with the filter delay which depends on the sample clock frequency.
*   This variable is written into CONFIG register during enabling
*   to HW IP block.
*
*******************************************************************************/
static void `$INSTANCE_NAME`_SsCSDSetFilterDelay(void)
{
    #if (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ)
        uint32 sampleClkFreqHz;
    #endif /* (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ) */

    `$INSTANCE_NAME`_configCsd &= ~`$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_MSK;

    #if (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ)
        sampleClkFreqHz = CYDEV_CLK_PERICLK__HZ / (uint32)`$INSTANCE_NAME`_dsRam.modCsdClk;
        if(sampleClkFreqHz <= `$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ)
        {
            `$INSTANCE_NAME`_configCsd |= `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_12MHZ;
        }
        else if(sampleClkFreqHz <= `$INSTANCE_NAME`_MOD_CSD_CLK_24MHZ)
        {
            `$INSTANCE_NAME`_configCsd |= `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_24MHZ;
        }
        else
        {
            `$INSTANCE_NAME`_configCsd |= `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_48MHZ;
        }
    #else
        `$INSTANCE_NAME`_configCsd |= `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_12MHZ;
    #endif /* (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ) */
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDConfigIDACs
****************************************************************************//**
*
* \brief
*   Configures the mode for IDAC registers
*
* \details
*   This function configures the IDAC modes depend on Compensation IDAC
*   enabled or disabled.
*
*******************************************************************************/
static void `$INSTANCE_NAME`_SsCSDConfigIDACs(void)
{
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR, `$INSTANCE_NAME`_IDAC_MOD_DEFAULT_CFG);
    #if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
         (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN))
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACB_PTR, `$INSTANCE_NAME`_IDAC_COMP_DEFAULT_CFG);
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)) */
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDInitialize
****************************************************************************//**
*
* \brief
*   This API initializes the CSD module.
*
* \details
*   The function performs the following steps:
*   1) Sets GPIO output to "0" for all sensor pins;
*   2) Connects CMOD to AMUXBUS-A and to CSDBUS-A;
*   3) Connects CMOD to (sense path) to CSDCOMP;
*   4) Connects Csh_tank to AMUXBUS-B and to CSDBUS-B;
*   5) Connects VREF to REFGEN;
*   6) Configures REFGEN and sets the reference voltage;
*   7) Connects VREF to CSDCOMP and HSCOMP;
*   8) Configures IDAC and connect to CSDBUS-A (to drive CMOD);
*   9) Configures ModClk;
*   10) Configure SnsClk source;
*   11) Sets other CSD configurations (Csd Auto Zero time,
*       Sample Init period, interrupts,
*       CMOD and Csh_tank/shield initialization switch resistance).
*
*******************************************************************************/
void `$INSTANCE_NAME`_SsCSDInitialize(void)
{
    uint32 newRegValue;

    /* Set all the sensors to inactive state */
    `$INSTANCE_NAME`_SsClearCSDSensors();
    `$INSTANCE_NAME`_BistDischargeExtCapacitors();

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        /* Connect shields to AMUX-B bus (config HSIOM regs) */
        #if (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT)
            `$INSTANCE_NAME`_SsCSDEnableShieldElectrodes();
        #endif /* (0u != `$INSTANCE_NAME`_CSD_TOTAL_SHIELD_COUNT) */

