simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CapSense_v2_0/API/CapSense_SensingCSD_LL.c
        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)
            /* Configure Csh */
            `$INSTANCE_NAME`_SsCSDEnableShieldTank();
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) */
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

    /* Initialize the unused CSD IP registers to defaut state */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SENSE_DUTY_PTR,       `$INSTANCE_NAME`_DEFAULT_SENSE_DUTY_SEL);

    /* Configure VREF */
    newRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR);
    newRegValue |= `$INSTANCE_NAME`_DEFAULT_SW_REFGEN_SEL;
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR, newRegValue);

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_SET_PTR,         `$INSTANCE_NAME`_DEFAULT_CSD_INTR_SET);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR,   `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_TANK_SEL);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_DSI_SEL_PTR,       `$INSTANCE_NAME`_DEFAULT_CSD_SW_DSI_SEL);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_ADC_CTL_PTR,          `$INSTANCE_NAME`_DEFAULT_CSD_ADC_CTL);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_AMBUF_PTR,            `$INSTANCE_NAME`_CSD_AMBUF_PWR_MODE_OFF);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR,    `$INSTANCE_NAME`_DEFAULT_SW_SHIELD_SEL);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR,      `$INSTANCE_NAME`_DEFAULT_SW_HS_P_SEL);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_N_SEL_PTR,      `$INSTANCE_NAME`_DEFAULT_SW_HS_N_SEL);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR,            `$INSTANCE_NAME`_DEFAULT_HSCMP_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IO_SEL_PTR,           `$INSTANCE_NAME`_DEFAULT_CSD_IO_SEL);

    /* Connect CMOD to AMUXBUS-A */
    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)`$INSTANCE_NAME`_CSD_CMOD_PORT_PTR, `$INSTANCE_NAME`_CSD_CMOD_PIN, CY_GPIO_DM_ANALOG);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)`$INSTANCE_NAME`_CSD_CMOD_PORT_PTR, `$INSTANCE_NAME`_CSD_CMOD_PIN,
                                                                       (en_hsiom_sel_t)`$INSTANCE_NAME`_CSD_CMOD_HSIOM_SEL);

    /* Connect AMUXBUS-A to CSDBUS-A */
    newRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_SW_BYP_SEL_PTR);
    newRegValue |= `$INSTANCE_NAME`_CSD_SW_BYP_SEL_SW_BYA_MSK;
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_BYP_SEL_PTR, newRegValue);

    /* Connect CMOD to (sense path) to CSDCOMP */
    #if (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION)
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE);
    #elif (`$INSTANCE_NAME`_CSD__CSHIELD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION)
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPS_STATIC_CLOSE);
    #else
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE);
    #endif /* (`$INSTANCE_NAME`_CSD__CMOD_PAD == `$INSTANCE_NAME`_CMOD_CONNECTION) */

    /* Configure shield driving path */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        /* Connect AMUXBUS-B to CSDBUS-B (and AMUXBUS-A to CSDBUS-A ) */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_BYP_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_BYP_SEL_SW_BYA_MSK | `$INSTANCE_NAME`_CSD_SW_BYP_SEL_SW_BYB_MSK);

        /* Connect AMUXBUS-B to HSCMP positive input */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR, 0x00000000uL);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

    /* Configure VREF */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)
        /* Connect VREF to REFGEN. Connect IDACB to CSDBUSA */
        newRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR);
        newRegValue |= `$INSTANCE_NAME`_CSD_SW_REFGEN_VREF_SRC | `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_IAIB_MSK;
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR, newRegValue);
    #else
        /* Connect VREF to REFGEN (IAIB switch is open) */
        newRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR);
        newRegValue |= `$INSTANCE_NAME`_CSD_SW_REFGEN_VREF_SRC;
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR, newRegValue);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN */

    #if (`$INSTANCE_NAME`_2000_MV > `$INSTANCE_NAME`_CYDEV_VDDA_MV)

        /* Connect VREFLOW (from AMBUF and RefGen is in bypass mode) to CSDCOMP when Vdda < 2 V */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE);

        /* Connect Vrefhi to AMUBUF positive input when Vdaa < 2V
         *  Connect AMUBUF to SCDCMP negative input when Vdaa < 2V
         */
        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
            #if (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
                CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_IRH_STATIC_CLOSE |
                                                                      `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_ICB_PHI2);
            #else
                CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_DEFAULT);
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

            CY_SET_REG32(`$INSTANCE_NAME`_CSD_REFGEN_PTR, `$INSTANCE_NAME`_CSD_REFGEN_WITH_SHIELD_CFG);
            CY_SET_REG32(`$INSTANCE_NAME`_CSD_AMBUF_PTR, `$INSTANCE_NAME`_CSD_AMBUF_PWR_MODE_NORM);
        #else
            CY_SET_REG32(`$INSTANCE_NAME`_CSD_REFGEN_PTR, `$INSTANCE_NAME`_CSD_REFGEN_NO_SHIELD_CFG);
            CY_SET_REG32(`$INSTANCE_NAME`_CSD_AMBUF_PTR, `$INSTANCE_NAME`_CSD_AMBUF_PWR_MODE_OFF);
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

        /* Connect VREFHI to HSCOMP */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_N_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE);
    #else

        /* Connect VREFHI (from RefGen) to CSDCOMP when Vdda >= 2 V */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE);

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)

            /* Configure REFGEN. Set reference voltage when Vdda >= 2 V */
            CY_SET_REG32(`$INSTANCE_NAME`_CSD_REFGEN_PTR, `$INSTANCE_NAME`_CSD_REFGEN_WITH_SHIELD_CFG);

